{
  "APP_TITLE": "FE Interview Guide",
  "NAV_TOPICS": "Topics",
  "NAV_PRACTICE": "Practice",
  "NAV_MENU": "Menu",
  "NAV_BACK_TO_TOPICS": "Back to topics",
  "ARIA_TOGGLE_SIDENAV": "Toggle sidenav",
  "ARIA_TOGGLE_THEME": "Switch to light",
  "ARIA_TOGGLE_THEME_DARK": "Switch to dark",
  "ARIA_TOGGLE_LANG": "Switch language",

  "NAV_TOPIC_javascript": "JavaScript",
  "NAV_TOPIC_angular": "Angular",
  "NAV_TOPIC_scss": "SCSS",
  "NAV_TOPIC_html": "HTML",
  "NAV_TOPIC_rxjs": "RxJS",
  "NAV_TOPIC_ngrx": "NgRx",
  "NAV_SUB_javascript_types": "Types and variables",
  "NAV_SUB_javascript_functions": "Functions",
  "NAV_SUB_javascript_async": "Asynchrony",
  "NAV_SUB_angular_components": "Components",
  "NAV_SUB_angular_routing": "Routing",
  "NAV_SUB_angular_forms": "Forms",
  "NAV_SUB_scss_variables": "Variables",
  "NAV_SUB_scss_mixins": "Mixins",
  "NAV_SUB_scss_nesting": "Nesting",
  "NAV_SUB_html_semantics": "Semantics",
  "NAV_SUB_html_forms": "Forms",
  "NAV_SUB_html_a11y": "Accessibility",
  "NAV_SUB_rxjs_observables": "Observable",
  "NAV_SUB_rxjs_operators": "Operators",
  "NAV_SUB_rxjs_subjects": "Subjects",
  "NAV_SUB_ngrx_store": "Store",
  "NAV_SUB_ngrx_actions": "Actions and reducers",
  "NAV_SUB_ngrx_effects": "Effects",

  "TOPIC_LABEL": "Topic",
  "TOPIC_PURPOSE_LABEL": "Purpose",
  "TOPIC_ROLE_LABEL": "Role in the program",
  "TOPIC_NOT_FOUND": "Topic not found",
  "TOPIC_NOT_FOUND_HINT": "Choose a topic from the list on the left.",

  "TOPIC_javascript_PAGE_TITLE": "Page: JavaScript",
  "TOPIC_javascript_PURPOSE": "A scripting language in the browser and the foundation of the frontend. Used for logic, DOM manipulation, asynchrony, and user interaction.",
  "TOPIC_javascript_ROLE": "Foundation of application UI logic and behavior.",
  "TOPIC_angular_PAGE_TITLE": "Page: Angular",
  "TOPIC_angular_PURPOSE": "A framework for building single-page applications (SPA). Provides components, routing, forms, HTTP, and build tooling.",
  "TOPIC_angular_ROLE": "Application shell: components, routing, DI, and build.",
  "TOPIC_scss_PAGE_TITLE": "Page: SCSS",
  "TOPIC_scss_PURPOSE": "A CSS preprocessor. Adds variables, nesting, mixins, and functions for organizing and reusing styles.",
  "TOPIC_scss_ROLE": "Organizing styles: variables, mixins, themes, and spacing without duplication.",
  "TOPIC_html_PAGE_TITLE": "Page: HTML",
  "TOPIC_html_PURPOSE": "Markup language for web pages. Defines structure and semantics (headings, lists, forms, links).",
  "TOPIC_html_ROLE": "Semantics and content markup in application templates.",
  "TOPIC_rxjs_PAGE_TITLE": "Page: RxJS",
  "TOPIC_rxjs_PURPOSE": "Reactive programming library based on Observable. Manages asynchronous data streams and events.",
  "TOPIC_rxjs_ROLE": "Asynchrony, HTTP, events, and data streams in Angular.",
  "TOPIC_ngrx_PAGE_TITLE": "Page: NgRx",
  "TOPIC_ngrx_PURPOSE": "Global state management (store) using the Redux pattern for Angular. Predictable updates via actions and reducers.",
  "TOPIC_ngrx_ROLE": "In this project NGXS is used as an alternative to NgRx; both address global state.",
  "TOPIC_DESC_javascript_types": "JavaScript is dynamically typed: variables hold values of any type. Use const for constants, let for reassignable variables. Primitives (number, string, boolean, null, undefined) and objects (arrays, plain objects) are the main building blocks. TypeScript adds optional static types on top.",
  "TOPIC_DESC_javascript_functions": "Functions encapsulate reusable logic. Declarations (function fn() {}), expressions (const fn = function () {}), and arrow functions (() => {}) are common. They can take default parameters and rest (...args). Return value is explicit or undefined.",
  "TOPIC_DESC_javascript_async": "Asynchronous code runs without blocking. Callbacks were the first approach; Promises (then/catch) and async/await provide a cleaner flow. fetch returns a Promise. async functions always return a Promise.",
  "TOPIC_DESC_angular_components": "Components are the main building blocks of Angular UIs. Each has a selector, template, and optional styles. @Input() and @Output() define the API. Standalone components can be used without declaring them in a module.",
  "TOPIC_DESC_angular_routing": "The Angular router maps URLs to components. Routes define path, component, and optional children. RouterLink and routerLinkActive in templates; Router service for programmatic navigation. Lazy loading is done via loadChildren.",
  "TOPIC_DESC_angular_forms": "Reactive forms use FormGroup, FormControl, and validators in the class. Template binds with [formGroup] and formControlName. Validators.required, minLength, and custom validators validate input.",
  "TOPIC_DESC_scss_variables": "Variables store colors, sizes, or any value for reuse. Defined with $name: value; and used as $name. They keep the design consistent and make theme changes easier.",
  "TOPIC_DESC_scss_mixins": "Mixins are reusable blocks of styles. Defined with @mixin name { ... } and included with @include name. They can take parameters and use @content for blocks passed by the caller.",
  "TOPIC_DESC_scss_nesting": "Selectors can be nested to reflect DOM structure. & refers to the parent selector (e.g. &:hover). Nesting keeps related styles together but should not be overused to avoid deep specificity.",
  "TOPIC_DESC_html_semantics": "Semantic elements (header, main, article, section, nav, footer) describe the meaning of content. They improve accessibility, SEO, and code clarity. Use them instead of generic divs where they fit.",
  "TOPIC_DESC_html_forms": "Forms collect user input. Use label with for linked to input id. name identifies the field for submission. type (text, email, password, etc.) and attributes like required and minlength provide validation and hints.",
  "TOPIC_DESC_html_a11y": "Accessibility (a11y) ensures all users can use the app. Associate labels with inputs, provide aria-label or aria-describedby where needed, use semantic HTML, and keep keyboard and screen reader support in mind.",
  "TOPIC_DESC_rxjs_observables": "An Observable is a stream of values over time. You subscribe to it to receive values, errors, or completion. Observables are lazy: they run only when subscribed. of() and from() create observables from static values or iterables.",
  "TOPIC_DESC_rxjs_operators": "Operators transform or combine observables. map and filter are common. mergeMap, switchMap, and concatMap handle inner observables (e.g. HTTP). pipe() chains operators.",
  "TOPIC_DESC_rxjs_subjects": "A Subject is both an Observable and an Observer: you can subscribe to it and call next(), error(), complete(). BehaviorSubject holds the current value and replays it to new subscribers.",
  "TOPIC_DESC_ngrx_store": "The store holds the single state tree. Selectors (createSelector) derive data from state. Components inject Store and use select() to subscribe to slices. State is read-only; changes happen only through actions and reducers.",
  "TOPIC_DESC_ngrx_actions": "Actions describe what happened (e.g. loadUsers, loadUsersSuccess). Reducers are pure functions (state, action) => newState. createAction and createReducer reduce boilerplate. Dispatch actions to trigger updates.",
  "TOPIC_DESC_ngrx_effects": "Effects handle side effects (HTTP, routing) in response to actions. They listen to actions$, perform async work, and dispatch new actions. Injectable services registered in the EffectsModule.",

  "PRACTICE_TITLE": "Practice / Quizzes",
  "PRACTICE_DESC": "Practice and quizzes section will be added later.",
  "PRACTICE_LINK_TOPICS": "To topics"
}
