{
  "APP_TITLE": "FE Interview Guide",
  "NAV_TOPICS": "Темы",
  "NAV_PRACTICE": "Практика",
  "NAV_MENU": "Меню",
  "NAV_BACK_TO_TOPICS": "К списку тем",
  "ARIA_TOGGLE_SIDENAV": "Открыть меню",
  "ARIA_TOGGLE_THEME": "Включить светлую тему",
  "ARIA_TOGGLE_THEME_DARK": "Включить тёмную тему",
  "ARIA_TOGGLE_LANG": "Сменить язык",

  "NAV_TOPIC_javascript": "JavaScript",
  "NAV_TOPIC_angular": "Angular",
  "NAV_TOPIC_scss": "SCSS",
  "NAV_TOPIC_html": "HTML",
  "NAV_TOPIC_rxjs": "RxJS",
  "NAV_TOPIC_ngrx": "NgRx",
  "NAV_SUB_javascript_types": "Типы и переменные",
  "NAV_SUB_javascript_functions": "Функции",
  "NAV_SUB_javascript_async": "Асинхронность",
  "NAV_SUB_angular_components": "Компоненты",
  "NAV_SUB_angular_routing": "Роутинг",
  "NAV_SUB_angular_forms": "Формы",
  "NAV_SUB_scss_variables": "Переменные",
  "NAV_SUB_scss_mixins": "Миксины",
  "NAV_SUB_scss_nesting": "Вложенность",
  "NAV_SUB_html_semantics": "Семантика",
  "NAV_SUB_html_forms": "Формы",
  "NAV_SUB_html_a11y": "Доступность",
  "NAV_SUB_rxjs_observables": "Observable",
  "NAV_SUB_rxjs_operators": "Операторы",
  "NAV_SUB_rxjs_subjects": "Subjects",
  "NAV_SUB_ngrx_store": "Store",
  "NAV_SUB_ngrx_actions": "Actions и reducers",
  "NAV_SUB_ngrx_effects": "Effects",

  "TOPIC_LABEL": "Тема",
  "TOPIC_PURPOSE_LABEL": "Для чего служит",
  "TOPIC_ROLE_LABEL": "За что отвечает в программе",
  "TOPIC_NOT_FOUND": "Тема не найдена",
  "TOPIC_NOT_FOUND_HINT": "Выберите тему из списка слева.",

  "TOPIC_javascript_PAGE_TITLE": "Страница: JavaScript",
  "TOPIC_javascript_PURPOSE": "Язык сценариев в браузере, основа фронтенда. Используется для логики, работы с DOM, асинхронности и взаимодействия с пользователем.",
  "TOPIC_javascript_ROLE": "Основа логики и поведения интерфейса приложения.",
  "TOPIC_angular_PAGE_TITLE": "Страница: Angular",
  "TOPIC_angular_PURPOSE": "Фреймворк для построения одностраничных приложений (SPA). Предоставляет компоненты, роутинг, формы, HTTP и инструменты сборки.",
  "TOPIC_angular_ROLE": "Каркас приложения: компоненты, маршрутизация, зависимость и сборка.",
  "TOPIC_scss_PAGE_TITLE": "Страница: SCSS",
  "TOPIC_scss_PURPOSE": "Препроцессор CSS. Добавляет переменные, вложенность, миксины и функции для удобной организации и переиспользования стилей.",
  "TOPIC_scss_ROLE": "Организация стилей: переменные, миксины, темы и отступы без дублирования.",
  "TOPIC_html_PAGE_TITLE": "Страница: HTML",
  "TOPIC_html_PURPOSE": "Язык разметки веб-страниц. Задаёт структуру и семантику контента (заголовки, списки, формы, ссылки).",
  "TOPIC_html_ROLE": "Семантика и разметка контента в шаблонах приложения.",
  "TOPIC_rxjs_PAGE_TITLE": "Страница: RxJS",
  "TOPIC_rxjs_PURPOSE": "Библиотека реактивного программирования на основе Observable. Управление асинхронными потоками данных и событиями.",
  "TOPIC_rxjs_ROLE": "Асинхронность, HTTP-запросы, события и потоки данных в Angular.",
  "TOPIC_ngrx_PAGE_TITLE": "Страница: NgRx",
  "TOPIC_ngrx_PURPOSE": "Глобальное управление состоянием (store) по паттерну Redux для Angular. Предсказуемые обновления состояния через actions и reducers.",
  "TOPIC_ngrx_ROLE": "В этом проекте для состояния используется NGXS как альтернатива NgRx; оба решают задачу глобального стейта.",
  "TOPIC_DESC_javascript_types": "В JavaScript переменные имеют динамическую типизацию: одна переменная может хранить значения разных типов. Используйте const для констант и let для изменяемых переменных. Примитивы (number, string, boolean, null, undefined) и объекты (массивы, объекты) — основа языка. TypeScript добавляет статическую типизацию.",
  "TOPIC_DESC_javascript_functions": "Функции инкапсулируют переиспользуемую логику. Бывают объявления (function fn() {}), выражения и стрелочные функции (() => {}). Поддерживаются параметры по умолчанию и rest (...args). Возвращают значение или undefined.",
  "TOPIC_DESC_javascript_async": "Асинхронный код выполняется без блокировки. Исторически использовались колбэки; Promises (then/catch) и async/await упрощают код. fetch возвращает Promise. Функция async всегда возвращает Promise.",
  "TOPIC_DESC_angular_components": "Компоненты — основные строительные блоки UI в Angular. У каждого есть selector, template и опциональные styles. @Input() и @Output() задают API. Standalone-компоненты не требуют объявления в модуле.",
  "TOPIC_DESC_angular_routing": "Роутер Angular сопоставляет URL и компоненты. Маршруты задают path, component и дочерние маршруты. В шаблонах — RouterLink и routerLinkActive; в коде — сервис Router. Ленивая загрузка через loadChildren.",
  "TOPIC_DESC_angular_forms": "Реактивные формы строятся на FormGroup, FormControl и валидаторах в классе. В шаблоне — [formGroup] и formControlName. Validators.required, minLength и кастомные валидаторы проверяют ввод.",
  "TOPIC_DESC_scss_variables": "Переменные хранят цвета, размеры и любые значения для переиспользования. Объявление: $имя: значение; использование: $имя. Обеспечивают единообразие и упрощают смену темы.",
  "TOPIC_DESC_scss_mixins": "Миксины — переиспользуемые блоки стилей. Объявление: @mixin имя { ... }, подключение: @include имя. Могут принимать параметры и использовать @content для переданного блока.",
  "TOPIC_DESC_scss_nesting": "Селекторы можно вкладывать по структуре DOM. & ссылается на родителя (например &:hover). Вложенность держит связанные стили рядом; не стоит углубляться из-за специфичности.",
  "TOPIC_DESC_html_semantics": "Семантические элементы (header, main, article, section, nav, footer) описывают смысл контента. Они улучшают доступность, SEO и читаемость разметки. Используйте их вместо лишних div.",
  "TOPIC_DESC_html_forms": "Формы собирают ввод пользователя. Связывайте label с input через for и id. Атрибут name нужен для отправки. type (text, email, password и др.), required и minlength задают валидацию и подсказки.",
  "TOPIC_DESC_html_a11y": "Доступность (a11y) нужна, чтобы приложением могли пользоваться все. Связывайте подписи с полями, при необходимости добавляйте aria-label и aria-describedby, используйте семантику и учитывайте клавиатуру и скринридеры.",
  "TOPIC_DESC_rxjs_observables": "Observable — поток значений во времени. Подписка (subscribe) получает значения, ошибки и завершение. Observable ленивый: выполняется только при подписке. of() и from() создают потоки из значений или итерируемых объектов.",
  "TOPIC_DESC_rxjs_operators": "Операторы преобразуют или комбинируют потоки. Часто используются map и filter. mergeMap, switchMap и concatMap работают с вложенными observable (например HTTP). Цепочка строится через pipe().",
  "TOPIC_DESC_rxjs_subjects": "Subject одновременно Observable и Observer: на него подписываются и в него вызывают next(), error(), complete(). BehaviorSubject хранит текущее значение и отдаёт его новым подписчикам.",
  "TOPIC_DESC_ngrx_store": "Store хранит единое дерево состояния. Селекторы (createSelector) выводят данные из состояния. Компоненты инжектят Store и используют select() для подписки на срезы. Состояние только для чтения; изменения только через actions и reducers.",
  "TOPIC_DESC_ngrx_actions": "Actions описывают событие (например loadUsers, loadUsersSuccess). Reducers — чистые функции (state, action) => newState. createAction и createReducer сокращают шаблонный код. Диспатч действий запускает обновление.",
  "TOPIC_DESC_ngrx_effects": "Effects обрабатывают побочные эффекты (HTTP, навигация) в ответ на действия. Слушают actions$, выполняют асинхронную работу и диспатчат новые действия. Регистрируются как Injectable в EffectsModule.",

  "PRACTICE_TITLE": "Практика / Квизы",
  "PRACTICE_DESC": "Раздел практики и квизов будет добавлен позже.",
  "PRACTICE_LINK_TOPICS": "К темам"
}
